from telegram import InlineKeyboardButton
import os 

main_keyboard = [[InlineKeyboardButton('پیشنهاد ویژه استاد الکس', callback_data='alex_recommendation')]]

BOT_TOKEN = os.getenv('BOT_TOKEN')

BACKEND_URL = os.getenv('BACKEND_URL')

START = '''
سلام و احترام❤️
وقت بخیر
 
✅خیلیییی ممنونم از اینکه مارو برای شروع یادگیری مکالمه زبان انگلیسی انتخاب کردید💚
با ما پرونده زبان انگلیسی تو برای همیشه ببند و بذار کنار 💪

✅بنده الکس، موسس و مدیر موسسه Englishdrop هستم.
مدرسِ مکالمه زبان انگلیسی و با روش ابداعی ( بدون کتاب و آزمون و دفتر و قلم) کاملا مکالمه محور

✅آدرس پیج اصلی اینستاگرام: 
Englishdrop.ir

✅برای ارتباط با ما و پشتیبانی فقط کافیست با شماره 09058511291 در تلگرام یا واتساپ در ارتباط باشید.

✅با ٣ تا کلیک ساده، ثبت نام تون انجام میشه😍

برای شروع ثبت نام دوره، روی آیکون پیشنهاد ویژه الکس، کلیک کنید👇
'''

REGISTRATION_GUIDE_MESSAGE = '''
اطلاعات خود را مانند نمونه ارسال کنید
نام و نام خانوادگی
شماره تماس
آیدی اینستاگرام برای عضویت در پیج دوره ها توجه شود که آیدی خود را بدون @ وارد کنید
توجه کنید که اطلاعات خود را حتما در ۳ خط به ترتیب خط اول نام و نام خانوادگی ، خط دوم شماره همراه و خط سوم آیدی اینستاگرام ، وارد کنید

مثال : 
الکس رضوانی
09121111111
englishdrop.ir
'''

REGISTRATION_INVALID_INPUT = '''
لطفا مشخصات خود را به فرمت درست وارد کنید ، مانند نمونه زیر :
الکس رضوانی
09121111111
nenglishdrop.ir
'''

INFORMATION_VERIFICATION = '''
آیا مشخصات خود را تایید می کنید ؟
نام و نام خانوادگی : {}
شماره همراه : {}
آدرس اینستاگرام : {}
'''

CREATE_USER_SUCCESSFULLY = 'ثبت نام با موفقیت انجام شد'

INTERNAL_ERROR = 'اختلالی بوجود آمده است ، لطفا جند لحظه دیگر تلاش کنید و در صورت مشاهده مجدد به پشتیبانی پیام دهید'

ALEX_RECOMANDATION = '<b>{}</b>\n{}\nهزینه دوره : {} تومان'

TRANSACTION_DETAIL = '''
مبلغ : {} تومان
شمارت کارت : {}
به نام : {}

لطفا مبلغ را به کارت بالا منتقل کنید و عکس رسید را در زیر این پیام ارسال کنید
'''